brew "gcc"
brew "openssl"
brew "readline" 
brew "sqlite3"
brew "xz"
brew "zlib" 
brew "tcl-tk@8"
brew "libb2"
brew "tmux"

brew "starship"

brew "uv"
brew "node"
brew "nvm"

brew "fzf"
brew "jq"
brew "httpie"
brew "pgcli"
brew "tlrc"
brew "ripgrep"
brew "direnv"
brew "gh"
brew "ncdu"

brew "coder"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

brew "tflint"

brew "snowflake-cli"
brew "azure-cli"

brew "autojump" # jump to a dir with `j nameofdir`
brew "thefuck" # redo a fubmled command